import Link from "next/link";
import { InView } from "../ui/in-view";
import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "../ui/accordion";

const faqs = [
  {
    question: "การเติบโตและขนาดของตลาด",
    answer:
      "ณ วันที่ 31 กรกฎาคม 2568 อุตสาหกรรมกองทุนรวมไทยมีจำนวนบริษัทจัดการกองทุน (AMC) ทั้งสิ้น 23 แห่ง และมีจำนวนกองทุนรวม 2,276 กองทุน โดยมี NAV รวมอยู่ที่ 5.01 ล้านล้านบาท การเติบโตของ NAV จาก 4.7 ล้านล้านบาทในปี 2567 เป็น 5.01 ล้านล้านบาทในปี 2568 สะท้อนถึงความเชื่อมั่นของนักลงทุนที่ยังคงมีต่อภาพรวมอุตสาหกรรม แม้จะอยู่ภายใต้ภาวะเศรษฐกิจที่มีแรงกดดันด้านอัตราดอกเบี้ย อย่างไรก็ตาม องค์ประกอบของตลาดบ่งชี้ถึงโครงสร้างแบบผู้ขายน้อยราย (Oligopoly) โดยส่วนแบ่งตลาดหลักกระจุกตัวอยู่ที่ AMC ขนาดใหญ่ 3 อันดับแรก (KASSET, SCBAM, BBAM) ซึ่งครองส่วนแบ่งตลาดรวมกันมากกว่า 50 เปอร์เซ็นต์ การที่ บลจ. Professional อยู่ในสภาวะการแข่งขันที่เข้มข้นนี้หมายความว่า การดำเนินกลยุทธ์ทางธุรกิจจะต้องเน้นการสร้างความแตกต่างของผลิตภัณฑ์ (Product Differentiation) หรือการเข้าถึงตลาดเฉพาะ (Niche Market) เช่น กองทุนธีมเฉพาะ (Thematic Funds) หรือการลงทุนที่เน้นปัจจัยด้านสิ่งแวดล้อม สังคม และธรรมาภิบาล (ESG) เพื่อให้สามารถเพิ่มส่วนแบ่งตลาดได้อย่างยั่งยืน",
  },
  {
    question: "การวิเคราะห์กระแสเงินสดและความเสี่ยงด้านสภาพคล่อง",
    answer:
      "ข้อมูลกระแสเงินสดสะสมต้นปีถึงปัจจุบัน (YTD Cashflow) ณ 31 กรกฎาคม 2568 อยู่ที่ 200,641 ล้านบาท ซึ่งแสดงถึงสภาพคล่องโดยรวมที่ดีในระยะสั้น อย่างไรก็ตาม การวิเคราะห์ข้อมูลในอดีตแสดงให้เห็นถึงความผันผวนและความอ่อนไหวต่อวิกฤตความเชื่อมั่นของนักลงทุนไทย ในอดีต อุตสาหกรรมเคยเผชิญกับกระแสเงินทุนไหลออกสุทธิอย่างรุนแรง โดยในปี 2561 มีการไหลออกสุทธิสูงถึง −248,302 ล้านบาท และในปี 2562 มีการไหลออกสุทธิ −182,647 ล้านบาท ตัวเลขเหล่านี้เน้นย้ำว่า สถานการณ์กระแสเงินสดไหลเข้าในปัจจุบันอาจนำไปสู่ความประมาทด้านการบริหารสภาพคล่อง การไหลเข้าที่สูงอาจสร้างความรู้สึกปลอดภัยที่ผิดพลาด หากความเสี่ยงด้านเครดิต (หลัง Fitch ปรับ Outlook) หรือความเสี่ยงด้านตลาดปะทุขึ้น อาจเกิดการไถ่ถอนในอัตราเร่ง (Run on the fund) ที่รวดเร็วและรุนแรงได้ การเตรียมพร้อมในการใช้เครื่องมือจัดการสภาพคล่องฉุกเฉินจึงมีความจำเป็นอย่างยิ่ง",
  },
  {
    question: "โครงสร้างสินทรัพย์และการกระจุกตัว",
    answer:
      "การที่ตราสารหนี้มีสัดส่วนเกือบครึ่งหนึ่งของ NAV (47 เปอร์เซ็นต์) ทำให้ความเสี่ยงด้านอัตราดอกเบี้ย (Duration Risk) กลายเป็นความเสี่ยงเชิงระบบ (Systemic Risk) ต่ออุตสาหกรรม. มูลค่าของกองทุนเหล่านี้อ่อนไหวต่อการปรับขึ้นของ Bond Yields ทั่วโลก นอกจากนี้ การที่สัดส่วนของ Unit Trust และทองคำ/โลหะมีค่าสูงถึง 25 เปอร์เซ็นต์ สามารถถูกตีความได้ว่านักลงทุนใช้สินทรัพย์เหล่านี้เป็นกลไกในการป้องกันความเสี่ยง (Hedge) จากภาวะเงินเฟ้อและความไม่แน่นอนทางภูมิรัฐศาสตร์  ซึ่งเป็นกลยุทธ์ที่สมเหตุสมผลภายใต้สภาพแวดล้อมโลกปัจจุบันที่เต็มไปด้วยความเสี่ยงด้านภูมิรัฐศาสตร์",
  },
  {
    question: "ความเสี่ยงจากการกระจุกตัวในจีนและเอเชีย",
    answer:
      "การวิเคราะห์ FDI Portfolio ของอุตสาหกรรมกองทุนรวมไทยเผยให้เห็นถึงการกระจุกตัวของการลงทุนในต่างประเทศอย่างชัดเจน โดยจีนเป็นประเทศที่กองทุนรวมไทยลงทุนมากที่สุด คิดเป็น 28.07 เปอร์เซ็นต์ของ FDI Portfolio ทั้งหมด (222,995.91 ล้านบาท) รองลงมาคือญี่ปุ่นที่ 17.31 เปอร์เซ็นต์ การกระจุกตัวนี้จำเป็นต้องมีการประเมิน Stress Test ใน FDI Portfolio ภายใต้สถานการณ์ที่จีนมีอัตราการเติบโตต่ำกว่าที่คาดการณ์ไว้ และมีการเพิ่มมาตรการภาษีจากสหรัฐฯ ซึ่งจะสร้างผลกระทบต่อทั้งเศรษฐกิจในประเทศจีนและภูมิภาคเอเชียแปซิฟิกที่ต้องพึ่งพาการส่งออก",
  },
  {
    question: "ความเสี่ยงด้านเศรษฐกิจและการเงินของไทย",
    answer:
      "Fitch Ratings ได้ปรับมุมมองความน่าเชื่อถือระยะยาวของประเทศไทยเป็น Negative จาก Stable ในเดือนกันยายน 2568 โดยยังคงอันดับเครดิตที่ 'BBB+'. การปรับลด Outlook นี้ไม่ใช่เพียงแค่การเปลี่ยนแปลงทางเทคนิค แต่เป็นสัญญาณเตือนที่สำคัญต่อเสถียรภาพทางการคลังของประเทศ การปรับมุมมองเป็น Negative นี้อาจส่งผลกระทบโดยตรงต่อต้นทุนทางการเงินของทั้งภาครัฐและภาคเอกชนในระยะกลาง หากนักลงทุนต่างชาติเริ่มประเมินความเสี่ยงด้านอธิปไตยทางการเงินสูงขึ้น. หาก Credit Spread ของพันธบัตรรัฐบาลไทยขยายตัว (ราคาลดลง) จะส่งผลกระทบโดยตรงต่อมูลค่า NAV ของกองทุนตราสารหนี้ในประเทศ ซึ่งคิดเป็น 47 เปอร์เซ็นต์ของ NAV อุตสาหกรรมโดยรวม. ดังนั้น ฝ่ายจัดการกองทุนต้องเพิ่มความระมัดระวังและเข้มงวดในการคัดเลือกหุ้นกู้เอกชน (Selective Credit Selection) เพื่อลดความเสี่ยงจากการผิดนัดชำระหนี้ (Credit Risk) ที่อาจเพิ่มขึ้นจากการชะลอตัวทางเศรษฐกิจ",
  },
  {
    question: "การเตรียมพร้อมสำหรับวิกฤตสภาพคล่อง",
    answer:
      "การกำหนดเกณฑ์และเงื่อนไขการใช้ Redemption Gate (เช่น การจำกัดการไถ่ถอนที่เปอร์เซ็นต์ของ NAV ใน 7 วันทำการ)  และ Side Pocket ต้องถูกระบุไว้อย่างชัดเจนในแผนฉุกเฉิน. จำเป็นต้องสร้างระบบ Early Warning System (EWS) ที่ติดตาม Net Liquidity Position รายวัน  โดยเฉพาะในกองทุนที่มีความเสี่ยงสูงต่อการไถ่ถอนจำนวนมาก ความเสี่ยงด้านสภาพคล่องมักทวีความรุนแรงขึ้นเมื่อเกิดวิกฤตความเชื่อมั่น เช่น กรณีที่ Fitch ปรับลดอันดับเครดิตของไทย  ซึ่งอาจกระตุ้นให้เกิดการไหลออกของเงินทุน. การเตรียมพร้อมด้านปฏิบัติการสำหรับการใช้เครื่องมือเหล่านี้อย่างรวดเร็วและเป็นไปตามกฎเกณฑ์จะช่วยรักษาเสถียรภาพของมูลค่า NAV ของกองทุนโดยรวม",
  },
  {
    question: "การพัฒนาระบบ Risk Monitoring",
    answer:
      "ฝ่ายบริหารความเสี่ยงควรยกระดับความสามารถในการทำ Stress Testing และ Scenario Analysis ให้ครอบคลุมปัจจัยที่เชื่อมโยงกัน (Non-linear relationship) และไม่เป็นไปตามปกติ (Non-Normal Distribution) การประเมินความเสี่ยงต้องคำนึงถึงความสัมพันธ์ระหว่างปัจจัย: ตัวอย่างเช่น หากมีการปรับลดอันดับเครดิตของประเทศ  สิ่งนี้อาจเร่งให้เกิดการไหลออกของเงินทุนต่างชาติ ซึ่งจะกระตุ้นให้เกิดการไถ่ถอนกองทุนตราสารหนี้ในประเทศ ซึ่งจะขยายความเสียหายจาก MTM Loss. การจำลองวงจรความเสี่ยงนี้อย่างละเอียดเป็นสิ่งสำคัญในการวางแผนการรับมือ",
  },
];

const UpdateMF = () => {
  return (
    <>
      <div className="w-full flex flex-col gap-2 justify-center items-center">
        <iframe
          src="https://app.powerbi.com/view?r=eyJrIjoiZTI3YWE5OWUtZTQ2My00ZTFiLWIwZWUtMmU4OWM1ZDFhZjgwIiwidCI6IjBhZDUyOThlLTI5NmQtNDVhYi1hNDQ2LWMwZDM2NGM1YjE4YiIsImMiOjEwfQ%3D%3D&fbclid=IwY2xjawNFt1ZleHRuA2FlbQIxMABicmlkETFMN3EyVXY3Z3VoTTd3cnVsAR4YjJXcUn7dESe91nn74Zl7iBTq7My2p537ysXrh3UEUTpVdEVuqxOIVIUhDQ_aem_53snUEQ-l26-r7T8znuztA"
          className="w-full h-[680px] border-0 rounded-xl shadow-lg"
          allowFullScreen
        />
        <p className="text-xs text-left opacity-50 flex gap-2">
          <span>ที่มา</span>
          <Link href="https://www.sec.or.th/TH/Pages/MARKETDATA/MARKETSTATISTICSDASHBOARD.aspx">
            <span>www.sec.or.th</span>
          </Link>
        </p>
      </div>

      <div>
        <div className="flex flex-col gap-4">
          <div>
            <h2 className="font-semibold text-lg">บทสรุป ณ สิ้นเดือน ก.ค. 2568</h2>
            <p className="text-xs opacity-50">มุมมองส่วนตัว</p>
          </div>

          <span>
            {`สถานการณ์เศรษฐกิจโลกในปี 2568 และ 2569 ถูกนิยามว่าอยู่ในภาวะ "ความยืดหยุ่นที่เปราะบาง ท่ามกลางความไม่แน่นอนที่ยังคงอยู่" (Tenuous Resilience amid Persistent Uncertainty)  ซึ่งสร้างแรงกดดันต่อผลการดำเนินงานและเสถียรภาพของอุตสาหกรรมกองทุนรวมไทยโดยรวม 

           `}
          </span>

          <span>
            {`
ณ วันที่ 31 กรกฎาคม 2568 มูลค่าสินทรัพย์สุทธิภายใต้การบริหาร (NAV) ของอุตสาหกรรมกองทุนรวม (ไม่รวม Vayupak, Property, และ Infrastructure Fund) อยู่ที่ 5.01 ล้านล้านบาท ซึ่งแม้จะแสดงถึงขนาดตลาดที่แข็งแกร่ง แต่ก็มีความเสี่ยงเชิงโครงสร้างจากการกระจุกตัวของสินทรัพย์และการสัมผัสกับความเสี่ยงด้านมหภาคที่เพิ่มขึ้น

ข้อค้นพบหลักชี้ให้เห็นว่า ภัยคุกคามหลักต่อ บลจ คือความเสี่ยงด้านตลาด (Market Risk) และความเสี่ยงด้านสภาพคล่อง (Liquidity Risk) ที่เกิดจากความผันผวนของอัตราดอกเบี้ยโลก และความเสี่ยงด้านเครดิตของไทยที่ถูกยกระดับจากการที่ Fitch Ratings ปรับลดมุมมองความน่าเชื่อถือ (Outlook) เป็น "Negative". การบริหารจัดการความเสี่ยงจึงต้องมุ่งเน้นการลดการกระจุกตัวของพอร์ตโฟลิโอ และการเตรียมความพร้อมด้านการบริหารสภาพคล่องเพื่อรองรับสถานการณ์วิกฤต (Tail Risk)
           `}
          </span>
        </div>
      </div>

      <div className="w-full mx-auto">
        <InView
          variants={{
            hidden: {
              opacity: 0,
              y: 30,
              scale: 0.95,
              filter: "blur(4px)",
            },
            visible: {
              opacity: 1,
              y: 0,
              scale: 1,
              filter: "blur(0px)",
            },
          }}
          transition={{ duration: 0.3, ease: "easeInOut" }}
          viewOptions={{ margin: "0px 0px -350px 0px" }}
        >
          <div className="w-full">
            <Accordion
              type="single"
              collapsible
              className="w-full"
              defaultValue="item-1"
            >
              {faqs &&
                faqs.map((faq, index) => (
                  <AccordionItem key={index} value={`item-${index + 1}`}>
                    <AccordionTrigger>{faq.question}</AccordionTrigger>
                    <AccordionContent className="flex flex-col gap-4 text-balance">
                      {faq.answer}
                    </AccordionContent>
                  </AccordionItem>
                ))}
            </Accordion>
          </div>
        </InView>
      </div>
    </>
  );
};
export default UpdateMF;
