import { NextResponse } from "next/server";
import puppeteer from "puppeteer";

export async function GET() {
  const url =
    "https://market.sec.or.th/public/idisc/th/Viewmore/new-mf?FirstSellEndDate=0000-00-00&SecuTypeCode=MF";

  try {
    const browser = await puppeteer.launch({
      headless: true,
      args: ["--no-sandbox", "--disable-setuid-sandbox"],
    });
    const page = await browser.newPage();
    await page.goto(url, { waitUntil: "networkidle2" });

    const rows = await page.$$eval("#gPP01T04 tbody tr", (trs) =>
      trs.map((tr) => {
        const tds = Array.from(tr.querySelectorAll("td"));
        return {
          บริษัทจัดการ: tds[0]?.innerText.trim() || "",
          ประเภทกองทุน: tds[1]?.innerText.trim() || "",
          ชื่อกองทุน: tds[2]?.innerText.trim() || "",
          ชื่อย่อกองทุน: tds[3]?.innerText.trim() || "",
          วันที่อนุมัติจัดตั้ง: tds[4]?.innerText.trim() || "",
          วันที่เริ่มการเสนอขาย: tds[5]?.innerText.trim() || "",
          วันที่สิ้นสุดการขาย: tds[6]?.innerText.trim() || "",
          หมายเหตุ: tds[7]?.innerText.trim() || "",
          Filing: tds[8]?.querySelector("a")?.href || "",
        };
      })
    );

    await browser.close();

    if (rows.length === 0) {
      return NextResponse.json({ error: "No data found after page render" });
    }

    return NextResponse.json(rows);

    // return NextResponse.json(rows);
  } catch (error) {
    console.error(error);
    return NextResponse.json(
      { error: "Internal server error" },
      { status: 500 }
    );
  }
}

// const rows = [
//   {
//     บริษัทจัดการ: "",
//     ประเภทกองทุน: "",
//     ชื่อกองทุน: "",
//     ชื่อย่อกองทุน: "",
//     วันที่อนุมัติจัดตั้ง: "",
//     วันที่เริ่มการเสนอขาย: "",
//     วันที่สิ้นสุดการขาย: "",
//     หมายเหตุ: "",
//     Filing: "",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุน วรรณ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิด วรรณ ไลฟ์ เซทเทิลเมนท์ 7 ห้ามขายผู้ลงทุนรายย่อย",
//     ชื่อย่อกองทุน: "ONE-LS7-UI",
//     วันที่อนุมัติจัดตั้ง: "12/09/2568",
//     วันที่เริ่มการเสนอขาย: "07/11/2568",
//     วันที่สิ้นสุดการขาย: "21/11/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0568&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุน วรรณ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน:
//       "กองทุนเปิด วรรณ ไลฟ์ เซทเทิลเมนท์ 7 อันเฮดจ์ ห้ามขายผู้ลงทุนรายย่อย",
//     ชื่อย่อกองทุน: "ONE-LS7UH-UI",
//     วันที่อนุมัติจัดตั้ง: "12/09/2568",
//     วันที่เริ่มการเสนอขาย: "07/11/2568",
//     วันที่สิ้นสุดการขาย: "21/11/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0774&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนกรุงไทย จำกัด (มหาชน)",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดกรุงไทยพันธบัตร 6M25",
//     ชื่อย่อกองทุน: "KTGOV6M25",
//     วันที่อนุมัติจัดตั้ง: "16/05/2568",
//     วันที่เริ่มการเสนอขาย: "30/09/2568",
//     วันที่สิ้นสุดการขาย: "03/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0495&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนกรุงไทย จำกัด (มหาชน)",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดกรุงไทยพันธบัตร 3M20F",
//     ชื่อย่อกองทุน: "KTGOV3M20F",
//     วันที่อนุมัติจัดตั้ง: "11/09/2568",
//     วันที่เริ่มการเสนอขาย: "25/09/2568",
//     วันที่สิ้นสุดการขาย: "29/09/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0845&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนกรุงศรี จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน:
//       "กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M132-ห้ามขายผู้ลงทุนรายย่อย (AI)",
//     ชื่อย่อกองทุน: "KFFAI6M132",
//     วันที่อนุมัติจัดตั้ง: "10/09/2568",
//     วันที่เริ่มการเสนอขาย: "23/09/2568",
//     วันที่สิ้นสุดการขาย: "29/09/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0840&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนกรุงศรี จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน:
//       "กองทุนเปิดกรุงศรีตราสารหนี้ต่างประเทศ 6M133-ห้ามขายผู้ลงทุนรายย่อย (AI)",
//     ชื่อย่อกองทุน: "KFFAI6M133",
//     วันที่อนุมัติจัดตั้ง: "24/09/2568",
//     วันที่เริ่มการเสนอขาย: "30/09/2568",
//     วันที่สิ้นสุดการขาย: "06/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0880&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนกรุงศรี จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดกรุงศรีพันธบัตรรัฐบาลสิงคโปร์ 6M25",
//     ชื่อย่อกองทุน: "KFSGB6M25",
//     วันที่อนุมัติจัดตั้ง: "17/09/2568",
//     วันที่เริ่มการเสนอขาย: "01/10/2568",
//     วันที่สิ้นสุดการขาย: "08/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0856&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนเกียรตินาคินภัทร จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดเคเคพี CAT BOND - USD ห้ามขายผู้ลงทุนรายย่อย",
//     ชื่อย่อกองทุน: "KKP CAT-USD-UI FUND",
//     วันที่อนุมัติจัดตั้ง: "16/09/2568",
//     วันที่เริ่มการเสนอขาย: "30/09/2568",
//     วันที่สิ้นสุดการขาย: "09/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0843&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนเกียรตินาคินภัทร จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดเคเคพี CAT BOND ห้ามขายผู้ลงทุนรายย่อย",
//     ชื่อย่อกองทุน: "KKP CAT-UI FUND",
//     วันที่อนุมัติจัดตั้ง: "16/09/2568",
//     วันที่เริ่มการเสนอขาย: "30/09/2568",
//     วันที่สิ้นสุดการขาย: "09/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0694&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนทิสโก้ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิด ทิสโก้ US Utilities",
//     ชื่อย่อกองทุน: "TUSUTIL",
//     วันที่อนุมัติจัดตั้ง: "24/03/2568",
//     วันที่เริ่มการเสนอขาย: "29/09/2568",
//     วันที่สิ้นสุดการขาย: "07/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0237&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนไทยพาณิชย์ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดไทยพาณิชย์ ตราสารตลาดเงิน เพื่อการเลี้ยงชีพ",
//     ชื่อย่อกองทุน: "SCBRMMONEY",
//     วันที่อนุมัติจัดตั้ง: "17/09/2568",
//     วันที่เริ่มการเสนอขาย: "23/09/2568",
//     วันที่สิ้นสุดการขาย: "29/09/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0706&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนไทยพาณิชย์ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดไทยพาณิชย์ตราสารภาครัฐ 3 เดือน 64",
//     ชื่อย่อกองทุน: "SCBSB3M64",
//     วันที่อนุมัติจัดตั้ง: "19/09/2568",
//     วันที่เริ่มการเสนอขาย: "23/09/2568",
//     วันที่สิ้นสุดการขาย: "29/09/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0875&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนไทยพาณิชย์ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดไทยพาณิชย์ตราสารภาครัฐ 6 เดือน 54",
//     ชื่อย่อกองทุน: "SCBSB6M54",
//     วันที่อนุมัติจัดตั้ง: "23/09/2568",
//     วันที่เริ่มการเสนอขาย: "26/09/2568",
//     วันที่สิ้นสุดการขาย: "30/09/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0883&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนไทยพาณิชย์ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดไทยพาณิชย์ตราสารภาครัฐ 3 เดือน 65",
//     ชื่อย่อกองทุน: "SCBSB3M65",
//     วันที่อนุมัติจัดตั้ง: "25/09/2568",
//     วันที่เริ่มการเสนอขาย: "30/09/2568",
//     วันที่สิ้นสุดการขาย: "06/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0892&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนพรินซิเพิล จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดพรินซิเพิล มาเลเซียน ฟิกซ์ อินคัม อันเฮดจ์",
//     ชื่อย่อกองทุน: "PRINCIPAL MYRFIUH",
//     วันที่อนุมัติจัดตั้ง: "19/09/2568",
//     วันที่เริ่มการเสนอขาย: "29/09/2568",
//     วันที่สิ้นสุดการขาย: "10/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0799&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนยูโอบี (ประเทศไทย) จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิด ยูไนเต็ด พันธบัตรรัฐ 6 เดือน 36",
//     ชื่อย่อกองทุน: "UGOV6M36",
//     วันที่อนุมัติจัดตั้ง: "11/06/2568",
//     วันที่เริ่มการเสนอขาย: "29/09/2568",
//     วันที่สิ้นสุดการขาย: "03/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0605&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนรวมบัวหลวง จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนรวมบัวหลวงธนสารพลัส 18/25 ห้ามขายผู้ลงทุนรายย่อย",
//     ชื่อย่อกองทุน: "BP18/25 (AI)",
//     วันที่อนุมัติจัดตั้ง: "23/09/2568",
//     วันที่เริ่มการเสนอขาย: "26/09/2568",
//     วันที่สิ้นสุดการขาย: "02/10/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0848&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนแลนด์ แอนด์ เฮ้าส์ จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิด แอล เอช นิวเคลียร์ เอนเนอร์จี",
//     ชื่อย่อกองทุน: "LHNUKZ",
//     วันที่อนุมัติจัดตั้ง: "09/09/2568",
//     วันที่เริ่มการเสนอขาย: "22/09/2568",
//     วันที่สิ้นสุดการขาย: "29/09/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0647&PYR=2568",
//   },
//   {
//     บริษัทจัดการ: "บริษัท หลักทรัพย์จัดการกองทุนอีสท์สปริง (ประเทศไทย) จำกัด",
//     ประเภทกองทุน: "กองทุนรวม",
//     ชื่อกองทุน: "กองทุนเปิดอีสท์สปริง พันธบัตรรัฐมุ่งรักษาเงินต้น 3M2",
//     ชื่อย่อกองทุน: "ES-GOVCP3M2",
//     วันที่อนุมัติจัดตั้ง: "18/09/2568",
//     วันที่เริ่มการเสนอขาย: "24/09/2568",
//     วันที่สิ้นสุดการขาย: "29/09/2568",
//     หมายเหตุ: "",
//     Filing:
//       "http://market.sec.or.th/public/mrap/MRAPView.aspx?FTYPE=M&PID=0871&PYR=2568",
//   },
// ];
